Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་གསེར་གྱི་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Seven leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་སྤོབས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཁས་པས་མཆོད་ཅེས་བྱ། །
en: The thus-gone Pratibhāna­rāṣṭra Will be born in a place called Worshiped by the Learned.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་དགུ་ཡབ་ནི་ཡོན་ཏན་དོན། །དོན་སྨྲ་བ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend ninety-nine leagues. Meaningful Qualities will be his father, and Meaningful Teaching will be this victor’s mother.

source: སྲས་པོ་ལྟ་བྱེད་ལེགས་མཐོང་རིམ་གྲོ་པ། །
en: Seer will be his son and Excellent Sight his attendant.

source: བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Ocean of Intelligence will be the scholar

source: མཆོག་ཏུ་ཁྱད་པར་འཕགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Supremely Distinguished the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཀུན་ལ་ཕན་ཕྱིར་སྙིང་བརྩེ་བ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering seven hundred forty million worthy ones “Who benefit everyone with loving affection.

source: མི་ཚེ་ལོ་གྲངས་ཁྲི་ཕྲག་སྟོང་རྩ་བཞི། །
en: The lifespan of humans will be ten million forty thousand years,

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And after this teacher has attained nirvāṇa His sacred Dharma will remain for seventy-six thousand years.

source: སངས་རྒྱས་རིན་ཆེན་རབ་སྦྱིན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཐམས་ཅད་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The buddha Ratnapradatta Will be born in a place called Universal Illumination.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་འབྱོར་པའི་ལྷ། །ལྷ་ཡི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. God of Wealth will be his father, and Ruler of Gods will be this victor’s mother.

source: སྲས་པོ་ལྷ་དགའ་ལྷ་ནི་རིམ་གྲོ་པ། །
en: Divine Joy will be his son and Divine his attendant.

source: བདུད་རྩིའི་དབྱངས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Nectar Melody will be the scholar

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །བྱས་པའི་མཐར་ཕྱིན་ཞི་བར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be ninety consecutive congregations, Each of them gathering seven hundred thirty million “Who have accomplished their deeds and reached peace.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་བཅུ་གསུམ་པ་གཅིག་གསེར་གྱིས་སྤྲས། །
en: “The stūpa with the relics of this victor Will be thirteen leagues large and adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་དགྱེས་པ་ཡི། །སྐྱེ་ཡུལ་ཟླ་བ་རྣམ་པར་སྣང་བྱེད་ཡིན། །
en: The thus-gone Priyacandra Will be born in a place called Illuminating Moon.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ཆགས་མེད་ཡིན། །ལྷ་ཡུལ་མཆོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend three leagues. Detached will be his father, and Worshiped by the Heavens will be this victor’s mother.

source: སྲས་པོ་པད་མ་སྣང་ལྡན་རིམ་གྲོ་པ། །
en: Lotus will be his son and Endowed with Light his attendant.

source: ཡུལ་འཁོར་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Land the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ངར་མི་འཛིན་པ་མཁའ་དང་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering eight hundred twenty million “Who are just like the sky and do not grasp an ‘I.’

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after this victor has attained nirvāṇa His sacred Dharma will remain for eighty thousand years.

source: འཇིག་རྟེན་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །ཁམས་གསུམ་དག་ཏུ་རྒྱས་ཤིང་གང་བར་འགྱུར། །
en: “For the benefit of wandering beings, the relics of this victor Will be abundant throughout the three realms.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟོབས་སྐྱེ་བའི། །ཡུལ་ནི་སེང་གེ་རྣམ་པར་བསྒྱིངས་ཞེས་བྱ། །
en: The thus-gone Siṃhabala Will be born in a place called Striding Lion.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཕན་དོན་ཡིན། །ལྷ་མཆོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend nine leagues. Beneficial Meaning will be his father, and Divine Worship will be this victor’s mother.

source: སྲས་པོ་བདེན་སྨྲ་དགེ་བ་རིམ་གྲོ་པ། །
en: True Speech will be his son and Virtue his attendant.

source: ལྷུན་པོའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Luminous Mountain will be the scholar

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །བདུད་དང་སྲེད་པའི་དྲ་བ་འཇོམས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering seven hundred forty million “Who have vanquished the māras and the web of craving.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་དྲུག་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety-six thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་ཐམས་ཅད་རྒྱས་འགྱུར་ལ། །གསེར་གྱི་རྒྱལ་མཚན་དག་གིས་འཁོར་བར་བསྐོར། །
en: “The relics of this victor will be abundant And surrounded by golden banners.

source: དེ་བཞིན་གཤེགས་པ་དབང་སྒྱུར་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: The thus-gone Vaśavartirāja Will be born in a place called Endowed with Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་བཅུ་རབ་ཏུ་གདུང་བ་ཡབ། །གྲགས་ཏོག་འཛིན་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ninety leagues. Yearning will be his father, and Holder of the Crest of Fame will be this victor’s mother.

source: སྲས་པོ་དབང་ཕྱིན་ཆོས་སྦྱིན་རིམ་གྲོ་པ། །
en: Perfection of Mastery will be his son and Sacrifice his attendant.

source: བཀོད་པ་སྣང་བར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Illuminating Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གཉིས་ཀུན་ལའང་། །ལམ་རབ་མཆོག་གིས་ཤིན་ཏུ་དུལ་བ་པོ། །ཐེར་འབུམ་ཕྲག་ནི་བཅུ་བཅུ་ཚང་བར་འགྱུར། །
en: There will be thirty-two consecutive congregations, Each of them gathering ten billion “Who have accomplished thorough training by means of the supreme path.

source: མི་ཚེ་ལོ་གྲངས་ཆིག་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: The lifespan of humans will be fifteen thousand years,

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་ཆིག་ཁྲི་ལྔ་སྟོང་གནས། །
en: And after this well-gone one has transcended suffering His sacred Dharma will remain for fifteen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །གསེར་གྱི་རྟ་བབས་མུ་ཏིག་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Adorned with golden gateways and canopies of pearls.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་གསལ་བ་ཡི། །སྐྱེ་ཡུལ་འཇིག་རྟེན་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Amṛtaprasanna Will be born in a place called Illuminating the World.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་གྲགས་བྱིན་ཡིན། །བདུད་རྩི་གྲགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend ten leagues. Fame Gift will be his father, and Nectar Fame will be this victor’s mother.

source: ཡོན་ཏན་འོད་སྲས་གཙོ་བོ་རིམ་གྲོ་པ། །
en: Luminous Qualities will be his son and Leader his attendant.

source: ས་ལ་འགྲོ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Moving upon the Ground will be the scholar

source: རྣམ་པར་དག་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Perfectly Pure Abiding the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །རྫུ་འཕྲུལ་རྐང་པ་མཆོག་ལ་དབང་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་རེ་རེ་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering seven hundred million “Who have mastered the supreme bases of miraculous power.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་དཔག་ཚད། །གསུམ་པ་ནོར་བུའི་ཆུན་པོ་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Three leagues large and adorned with heaps of jewels and canopies.

source: དེ་བཞིན་གཤེགས་པ་བསམ་གཏན་སྙོམས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཕགས་པས་བལྟས་ཞེས་བྱ། །
en: The thus-gone Samadhyāyin Will be born in a place called Beheld by the Noble.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་དབྱངས་བཟངས་ཡིན། །དབྱངས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Excellent Melody will be his father, and Possessor of Melody will be this victor’s mother.

source: སྲས་པོ་ལེགས་པ་མ་སྨད་རིམ་གྲོ་པ། །
en: Excellence will be his son and Irreproachable his attendant.

source: ཉི་མ་སྒྲོན་མ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Sun Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་གཡོ་མེད་དྲི་མ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རེ་རེ་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering two hundred million “Worthy ones, immutable and stainless.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཅུ་གཅིག་པ་ལ་རིན་ཆེན་སྤྲས། །
en: “The relics of this victor will reside in a single stūpa Eleven leagues large and studded with jewels.

source: མི་ཡི་འདྲེན་པ་འཁྲུག་པ་མེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བྱམས་པས་བལྟས་ཞེས་བྱ། །
en: The guide of humans, Akṣobhya, Will be born in a place called Beheld by Love.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་ལྔ་ལྷ་ཡི་རྫུ་འཕྲུལ་ཡབ། །ལྷ་དགའ་རྒྱལ་བའི་ཡུམ་ཡིན་སྲས་པོ་ནི། །ལྷ་བྱེད་ན་ཚོད་བཟང་པོ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-five leagues. Divine Miracle will be his father, and Divine Joy will be this victor’s mother. Divine Action will be his son and Excellent Youth his attendant.

source: ཤིན་ཏུ་བསྒོམས་པའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Highly Trained Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་བདག་ཉིད་དུལ་བ་པོ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: There will be eighty consecutive congregations, Each of them gathering one billion “Worthy ones who have all tamed themselves.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་བརྒྱད་སྟོང་བར་དུ་གནས། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for seventy-eight thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་རྣམས་ཀུན་ཏུ་མཆོད་རྟེན་དག་གིས་གང་། །
en: “The relics of this victor will be abundant, And all realms will be filled with stūpas.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་རབ་ཞི་བའི། །སྐྱེ་བའི་ཡུལ་ནི་ཞི་བའི་འོད་ཅེས་བྱ། །
en: The thus-gone Praśāntamala Will be born in a place called Light of Peace.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་རབ་ཏུ་ཞི་བ་ཡབ། །དབང་པོ་དུལ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-four leagues. Thoroughly Peaceful will be his father, and Sense Control will be this victor’s mother.

source: སྲས་པོ་མཛེས་པ་ལེགས་ཞི་རིམ་གྲོ་པ། །
en: Beauty will be his son and Excellent Peace his attendant.

source: ཐར་པར་གཞོལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Merging with Liberation the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །བདུད་དང་ཉོན་མོངས་རབ་ཏུ་འཇོམས་པ་པོ། །དེ་དག་ཐེར་འབུམ་གཉིས་གཉིས་འདུས་པར་འགྱུར། །
en: There will be sixty-two consecutive congregations, Each of them gathering two billion “Who have vanquished the māras and defilements.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཆིག་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: And after this teacher has attained nirvāṇa His sacred Dharma will remain for thirteen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་ཀུན་ནས་མཛེས་པར་བྱས། །
en: “The relics of this victor will reside in a single stūpa Eight leagues large and beautifully decorated.

source: དེ་བཞིན་གཤེགས་པ་ཕྱོགས་མ་བསླད་པ་ཡི། །སྐྱེ་ཡུལ་ཀུ་མུ་ད་ཡི་གཟི་བརྗིད་ཡིན། །
en: The thus-gone Deśāmūḍha Will be born in a place called Splendid Kumuda.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཅིག་ཆོས་ཀྱི་སྐར་མདའ་ཡབ། །ཕྱོགས་ལྟ་རྒྱལ་ཡུམ་སྲས་པོ་གཟི་བརྗིད་ཅན། །གི་མི་ལ་ཞེས་བྱ་བ་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend twenty-one leagues. Dharma Meteor will be his father, and Seeing in All Directions will be this victor’s mother. Splendid will be his son and Gimila his attendant.

source: སྤོང་སྤོབས་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Relinquishment and Acumen the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །སྲེད་པ་ཀུན་ལ་ཆགས་བྲལ་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་བཅུ་བཞི་བཅུ་བཞི་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering one hundred forty million “Whose minds are entirely free from craving and attachment.

source: འགྲོ་ལ་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །ཞིང་རྣམས་རྒྱས་ཤིང་རྣམ་པར་གང་བར་འགྱུར། །
en: “For the benefit of wandering beings, the relics of this victor Will reside be abundant, filling the realms.

source: མི་ཡི་འདྲེན་པ་མཛེས་པ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་རྣམ་པར་བརྒྱན་པའི་མཆོག་ཅེས་བྱ། །
en: The guide of humans, Laḍita, Will be born in a place called Supreme Adornment.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལྷ་དབང་ཡིན། །འཇིག་རྟེན་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend one hundred leagues. Divine King will be his father, and Light of the World will be this victor’s mother.

source: སྲས་པོ་གཙོ་བོ་ཐར་འབྱོར་རིམ་གྲོ་པ། །
en: Leader will be his son and Reaching Liberation his attendant.

source: མཐུ་རྩལ་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding Power the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ལྟ་བ་ཕལ་ཆེན་མ་ལུས་སྤོང་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering nine hundred ninety million “Who give up all the vast views without exception.

source: དམ་ཆོས་ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་གནས། །མཆོད་རྟེན་དཔག་ཚད་བཅྭ་ལྔ་པ་གཅིག་སྟེ། །
en: And the sacred Dharma will remain for seventy-six thousand years. The single stūpa will be fifteen leagues large,

source: གསེར་དང་ནོར་བུ་ཀུན་གྱི་ལྡ་ལྡི་བཤམས། །གདུགས་གྲངས་བརྒྱ་སྙེད་དག་གིས་འཁོར་བར་བསྐོར། །
en: “Decorated with strands of gold and all kinds of jewels And surrounded by hundreds of parasols.

source: འཇིག་རྟེན་མཆོག་མ་ཞལ་བཟངས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་འཇིག་རྟེན་ལེགས་པར་ལྟ་ཞེས་བྱ། །
en: The one supreme in the world, Suvaktra, Will be born in a place called Regarded Well by the World.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལུས་བཟངས་ཡིན། །མཉམ་ཉིད་མཆོག་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend nine leagues. Excellent Body will be his father, and Supreme Equality will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་བློ་ལྡན་རིམ་གྲོ་པ། །
en: Leader will be his son and Intelligent his attendant.

source: ཤེད་སྐྱེས་དབང་ཕྱུག་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: “Lord of Humans will be the scholar

source: ལེགས་དུལ་སྒྲོན་མ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Lamp of Excellent Training the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །ལྷ་མི་དག་ལ་ཕན་ཕྱིར་གནས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be eight consecutive congregations, Each of them gathering three hundred forty million “Who remain for the sake of benefiting gods and humans.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཅུ་རྩ་བདུན་ཡིན། །
en: The lifespan of humans will be thirty-seven years,

source: རྒྱལ་བ་ཤུགས་གནས་ཡེ་ཤེས་ལྡན་པ་ཡི། །སྐྱེ་ཡུལ་བསོད་ནམས་ལེགས་པར་བསགས་ཞེས་བྱ། །
en: The victorious Sthita­vega­jñāna Will be born in a place called Excellent Accumulation of Merit.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཡོད་ཡབ་ནི་ཡོན་ཏན་དོན། །དོན་གྱི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend seven leagues. Meaningful Qualities will be his father, and Meaningful Light will be this victor’s mother.

source: སྲས་པོ་ཀུན་འཕགས་དགའ་བོ་རིམ་གྲོ་པ། །
en: Superior in All Regards will be his son and Joyous his attendant.

source: ཤེས་བཟོད་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Understanding and Acceptance will be the scholar

source: རྣམ་པར་གྲགས་པའི་སྒྲོན་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Lamp of Fame the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །ཡོན་ཏན་མཆོག་གི་མེ་ཏོག་ཁ་རྒྱས་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be ninety consecutive congregations, Each of them gathering two hundred forty million “Who are blooming flowers of supreme qualities.

source: གྲགས་པ་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག ། ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of this being of infinite fame Will remain for twenty-two thousand years.

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་སྐུ་གདུང་དག །འགྲོ་ལ་ཕན་ཕྱིར་ཞིང་རྣམས་གང་བར་འགྱུར། །
en: “The relics of the one who attained nirvāṇa Will fill the realms for the benefit of beings.

source: འཇིག་རྟེན་མཆོག་མ་གསུང་བའི་དབང་པོ་ཡི། །སྐྱེ་ཡུལ་སྨྲ་བའི་དབང་ཕྱུག་མཆོག་ཅེས་བྱ། །
en: The one who is supreme in the world, Kathendra, Will be born in a place called Supreme Master of Speech.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཤིང་རྟ་དབང་པོ་ཡབ། །འཕགས་པའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend thirty-two leagues. Chariot Ruler will be his father, and Light of the Noble will be this victor’s mother.

source: སྲས་པོ་གྲགས་དགའ་བསོད་ནམས་རིམ་གྲོ་པ། །
en: Joyous Fame will be his son and Merit his attendant.

source: དགེ་བའི་སྟོབས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Strength of Virtue will be the scholar

source: ཆོས་ཀྱི་ང་རོ་མཆོག་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Dharma Roar the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །བླ་མེད་བྱང་ཆུབ་མཆོག་ལ་ངེས་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: There will be thirty consecutive congregations, Each of them gathering one trillion “Who are certain to attain supreme awakening.

source: ལྷ་མི་དག་ལ་ཕན་ཕྱིར་རྒྱལ་བ་ཡི། །སྐུ་གདུང་དག་གིས་རྒྱས་ཤིང་གང་བར་འགྱུར། །
en: “For the benefit of gods and humans, the abundant relics Of this victor will fill the realms.

source: མཚུངས་པ་མེད་པ་གཟི་བརྗིད་ཆེན་པོ་ཡི། །སྐྱེ་ཡུལ་ལྷ་ཡིས་ཕྱག་བྱས་པ་ཞེས་བྱ། །
en: The incomparable Mahātejas Will be born in a place called Revered by Gods.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་ལྷ་རྫས་བཟང་པོ་ཡབ། །ལྷ་ཡི་དབང་ཕྱུག་རྒྱལ་ཡུམ་ཡོན་ཏན་མཆོག །སྲས་ཡིན་ཡོན་ཏན་གྲགས་པ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-four leagues. Excellent Divine Substance will be his father, and Ruler of Gods will be this victor’s mother. Supreme Qualities will be his son and Renowned Qualities his attendant.

source: ཐར་པའི་རྒྱལ་མཚན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Banner of Liberation will be the scholar

source: དོན་ལེགས་བསམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Well-Considered Aims the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་འབྲས་བུ་མཆོག་ནི་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering two hundred twenty million worthy ones “Who abide in the supreme fruition.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་ལྔའི་བར་དུ་གནས། །
en: And when this teacher has attained parinirvāṇa His sacred Dharma will remain for fifteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ཟབ་མོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་མཆོག་ཅེས་བྱ། །
en: The thus-gone Gambhīramati Will be born in a place called Supreme Land.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་གྲགས་དོན་ཡིན། །ཡོན་ཏན་བརྒྱན་པ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡོན་ཏན་མཆོག་མ་གྲུབ་པ་རིམ་གྲོ་པ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Famed Meaning will be his father, and Adorned with Qualities will be this victor’s mother. Supreme Qualities will be his son and Accomplished his attendant.

source: བྱང་ཆུབ་ཡོན་ཏན་འཛིན་པ་བློ་ཅན་ཏེ། །
en: “Holder of the Qualities of Awakening will be the one of intelligence

source: མཆོད་བསྔགས་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Worship and Praise the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་བྱེ་བ་ཕྲག་ནི་བརྒྱད་བརྒྱད་དང་། །གཞན་ཡང་ས་ཡ་ཕྲག་ནི་གཉིས་གཉིས་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering eighty million worthy ones “Along with two million others.

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲིར་གནས་པར་འགྱུར། །
en: And when this victor has attained parinirvāṇa His sacred Dharma will remain for thirty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གཉིས་པ་གཅིག་མུ་ཏིག་བླ་རེར་ལྡན། །
en: “The stūpa containing the relics of this victor Will be twelve leagues large and adorned with canopies of pearl.

source: འཇིག་རྟེན་མགོན་པོ་བདུད་རྩི་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གཟི་བརྗིད་དཔག་ཏུ་མེད་ཅེས་བྱ། །
en: The protector of the world, Amṛta, Will be born in a place called Immeasurable Splendor.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཉིས་ཡབ་ནི་མཐའ་ཡས་ཡིན། །ང་རོ་མཐའ་ཡས་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཀུ་མུ་ད་ཡིན་ལྟ་བྱེད་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend twelve leagues. Infinite will be his father, and Infinite Roar will be this victor’s mother. Kumuda will be his son and Seer his attendant.

source: འཇིག་རྟེན་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joy for the World will be the scholar

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །གང་ཟག་དམ་པ་དགྲ་ནི་ཆོམས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering seven hundred forty million “Holy people who have become worthy ones.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་འབྱུང་། །
en: “The relics of this victor will be abundant, And there will appear nine hundred billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོབས་སྐྱེ་བའི་ཡུལ། །བསོད་ནམས་ཏོག་གི་རྒྱལ་མཚན་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Dharmabala Will be born in a place called Crest Banner of Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །ཚངས་པའི་མཆོད་རྟེན་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །དབང་པོ་ཐུལ་ཡིན་ཞི་བ་རིམ་གྲོ་པ། །
en: “The family of this victor will be brahmin, And his light will extend three leagues. Excellent Brahmā will be his father, and Brahmā Stūpa will be this victor’s mother. Sense Control will be his son and Peace his attendant.

source: ཡོན་ཏན་སྣང་བར་བྱེད་པ་མཁས་པ་སྟེ། །
en: “Illuminating Qualities will be the scholar

source: ཡོན་ཏན་མཆོག་ལ་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding by Supreme Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་དྲུག་ཀུན་ལའང་། །རྡུལ་ཞི་དྲི་མ་གསུམ་དང་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be ninety-six consecutive congregations, Each of them gathering nine hundred ninety million “Immaculate ones who are free from the three stains.

source: བློ་གྲོས་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this teacher of infinite intelligence Will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གཅིག་པ་གཅིག་རིན་ཆེན་དྲ་བར་ལྡན། །
en: “The stūpa containing the relics of this victor Will measure eleven leagues and be draped with jewel nets.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་ལྡན་སྐྱེ་བའི་ཡུལ། །བསོད་ནམས་དག་གིས་བསྒྲུབས་པ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Pūjya Will be born in a place called Accomplished with Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་ཟླ་བའི་དབང་པོ་ཡབ། །ཟླ་བའི་ཏོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend twenty leagues. Moon Ruler will be his father, and Moon Crest will be this victor’s mother.

source: སྲས་པོ་མཆོག་མ་དེས་པ་རིམ་གྲོ་པ། །
en: Supreme will be his son and Gentle his attendant.

source: ཡེ་ཤེས་དགེ་བ་འཆད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Teacher of Wisdom and Merit the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་བཞི་ཀུན་ལའང་། །དགྲ་བཅོམ་ཞི་བའི་ཡིད་ལྡན་བསམ་གཏན་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: There will be thirty-four consecutive congregations, Each of them gathering one billion “Meditating worthy ones whose minds are serene.
